src/cf/Documents/РегистрацияРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РегистрацияРабочегоВремени</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетВремениПоКомпетенциям</xr:Item>
				<xr:Item>AccumulationRegister.УчетРабочегоВремени</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочееВремя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСписания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЗаписи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Часы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/РегистрацияРабочегоВремениСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Получить структуру регистрации рабочего времени
// 
// Возвращаемое значение:
//  СтруктураДанных - Структура - Структура с данными для заполнения
//
Функция ПолучитьСтруктуруРегистрацииРабочегоВремени() Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Дата", "");
	СтруктураДанных.Вставить("Номер", "");
	СтруктураДанных.Вставить("Ответственный", Пользователи.ТекущийПользователь());
	СтруктураДанных.Вставить("Комментарий", "");
	РабочееВремя = Новый ТаблицаЗначений;
	РабочееВремя.Колонки.Добавить("ДатаРегистрации");
	РабочееВремя.Колонки.Добавить("ДатаСписания");
	РабочееВремя.Колонки.Добавить("ЗадачаПроекта");
	РабочееВремя.Колонки.Добавить("ИдентификаторЗаписи");
	РабочееВремя.Колонки.Добавить("ОписаниеРаботы");
	РабочееВремя.Колонки.Добавить("Проект");
	РабочееВремя.Колонки.Добавить("Сотрудник");
	РабочееВремя.Колонки.Добавить("Часы");
	СтруктураДанных.Вставить("РабочееВремя", РабочееВремя);
	
	Возврат СтруктураДанных;
	
КонецФункции

// Функция - Сформировать регистрацию рабочего времени
//
// Параметры:
//  СтруктураДанных - Структура - Данные шапки и табличной части по которой создается документ регистрация рабочего времени
// 
// Возвращаемое значение:
//  ДокументСсылка.РегистрацияРабочегоВремени - Ссылка на созданный документ
//
Функция СформироватьРегистрациюРабочегоВремени(СтруктураДанных) Экспорт
	
	ДокументОбъект = Документы.РегистрацияРабочегоВремени.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ДокументОбъект, СтруктураДанных, , "РабочееВремя");
	ДокументОбъект.РабочееВремя.Загрузить(СтруктураДанных.РабочееВремя);
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции

#КонецОбласти
